

################## 一、生成标志的 字母+数字 代号 ##################
# 禁止标志
prohibits_a = ['pa'+str(i) for i in range(1,101)]
prohibits_m = ['pm'+str(i) for i in range(1,101)]
prohibits_w1 = ['pw'+str(int(i/10)) for i in range(10,101) if (i%10)==0]
prohibits_w2 = ['pw'+str(i/10) for i in range(10,101) if (i%10)!=0]
prohibits_h1 = ['ph'+str(int(i/10)) for i in range(10,101) if (i%10)==0]
prohibits_h2 = ['ph'+str(i/10) for i in range(10,101) if (i%10)!=0]
prohibits_l = ['pl'+str(i) for i in range(5,130,5)]
prohibits_r = ['pr'+str(i) for i in range(5,130,5)]
prohibits = prohibits_a+prohibits_m+prohibits_w1+prohibits_w2+prohibits_h1+prohibits_h2+\
			prohibits_l+prohibits_r

# 指示标志
instructions_l = ['il'+str(i) for i in range(5,130,5)]

# 箭头标志
arrows = ['a'+str(i) for i in range(1,9)]

# 关系
affiliations = ['l'+str(i) for i in range(1,20)]
################## 二、生成标志的 字母+数字 代号 ##################



# 禁止标志 symbol 转 string
p_string = ['停车让行','减速让行','会车让行','禁止通行','禁止驶入','禁止机动车驶入','禁止大型载客汽车驶入',
			'禁止小型载客汽车驶入','禁止载货汽车驶入','禁止挂车、半挂车驶入','禁止拖拉机驶入',
			'禁止三轮汽车、低速货车驶入','禁止摩托车驶入','禁止非机动车进入','禁止电动自行车车进入',
			'禁止畜力车进入','禁止三轮车驶入','禁止人力客运三轮车进入','禁止人力货运三轮车进入',
			'禁止人力车进入','禁止行人进入','禁止某两种车辆驶入','禁止向左转弯','禁止向右转弯',
			'禁止载货汽车向左转弯','禁止小型客车向右转弯','禁止直行','禁止向左和向右转弯',
			'禁止直行和向左转弯','禁止直行和向右转弯','禁止掉头','禁止超车','解除禁止超车',
			'禁止车辆停放','禁止车辆长时停放','禁止鸣喇叭','停车检查','海关','禁止危险物品运输车辆驶入',
			'减速慢行','解除禁止鸣喇叭','禁止农用拖挂车驶入','禁止行人自行车驶入',
			]
p_dict = {}
for i, pst in enumerate(p_string):
	p_dict['p' + str(i+1)] = pst

pother_dict = {'pa':'限制最大轴重', 'ph':'限制最大高度','pl':'最高限速','pm':'限制最大质量','pr':'解除限速','pw':'限制最大宽度'}
for prohibit in prohibits:
	symbol, number = prohibit[:2], prohibit[2:]
	string = pother_dict[symbol]
	if '轴重' in string or '质量' in string: p_dict.update({prohibit:string+str(number)+'吨'})
	if '限速' in string: p_dict.update({prohibit:string+str(number)+'km/h'})
	if '高度' in string or '宽度' in string: p_dict.update({prohibit:string+str(number)+'米'})


# 警告标志 symbol 转 string
w_string = ['交叉路口，注意横向来车','交叉路口，注意横向来车','交叉路口，注意横向来车','交叉路口，注意横向来车','交叉路口，注意横向来车',
			'交叉路口，注意横向来车','交叉路口，注意横向来车','交叉路口，注意横向来车','交叉路口，注意横向来车','交叉路口，注意横向来车',
			'注意向左紧急转弯','注意向右紧急转弯','注意反向弯路','注意反向弯路','注意连续弯路','注意连续弯路','注意上陡坡','注意下陡坡',
			'注意连续下坡','注意两侧变窄','注意右侧变窄','注意左侧变窄','注意窄桥','注意双向交通','注意行人','注意行人','注意儿童','注意儿童',
			'注意残疾人','注意残疾人','注意非机动车','注意电动自行车','注意牲畜','注意野生动物','注意信号灯','注意左侧落石','注意右侧落石',
			'注意横风','注意路面易滑','注意左侧傍山险路','注意右侧傍山险路','注意堤坝路','注意堤坝路','注意村庄','注意隧道','注意驼峰桥',
			'注意路面不平','注意减速丘','注意过水路面或漫水桥','有人看守铁路道口','无人看守铁路道口','多股铁路与道路相交','事故易发路段',
			'注意左右绕行','注意左侧绕行','注意右侧绕行','注意危险','注意施工','注意交通事故管理','注意潮汐车道','注意保持车距','注意合流',
			'注意合流','注意车道数变少','注意车道数变少','注意路面结冰','注意雨雪天','注意雾天','注意不利气象条件','注意前方车辆排队',
			'注意线形变化','注意线形变化','注意线形变化','注意两侧通行','注意右侧通行','注意左侧通行','注意渡口','注意隧道开车灯',
			'注意路面低洼','注意慢行','注意丁字平面交叉','注意十字平面交叉','注意线形变化'
			]
w_dict = {}
for i, wst in enumerate(w_string):
	w_dict['w' + str(i+1)] = wst

# 指示标志 symbol 转 string
i_string = ['直行','向左转弯','向右转弯','直行和向左转弯','直行和向右转弯','向左和向右转弯','分隔带右侧行车','分隔带左侧行车',
			'环岛行驶','向右单行路','向右单行路','向左单行路','直行单行路','直行单行路','请鸣喇叭','请打开车灯','请会车先行',
			'人行横道','人行横道','右转车道','左转车道','直行车道','直行和右转合用车道','直行和左转合用车道','掉头车道',
			'掉头和左转合用车道','机动车行驶','机动车车道','机动车车道','机动车车道','小型客车车道','小型客车车道',
			'公交专用车道','公交专用车道','公交专用车道','公交专用车道','快速公交系统专用车道','快速公交系统专用车道',
			'有轨电车专用车道','多乘员车辆专用车道','非机动车行驶','非机动车车道','非机动车车道','电动自行车行驶',
			'电动自行车车道','电动自行车车道','行人','非机动车与行人分开空间通行','非机动车与行人分开空间通行',
			'非机动车与行人共享空间通行','非机动车推行','靠右侧车道行驶','停车位','停车位','停车位','停车位',
			'残疾人专用停车位','残疾人专用停车位','校车专用停车位','校车专用停车位','校车专用停车位',
			'出租车专用停车位','出租车专用停车位','允许掉头','硬路肩允许行驶','硬路肩允许行驶','硬路肩允许行驶',
			'货车通行','立体交叉直行和右转弯行驶','立体交叉直行和左转弯行驶','路口优先通行','分向行驶车道',
			'紧急停车带','小型客车','小型客车','大型客车','大型货车','自行车','电动自行车',
			'右侧合流','右侧分叉','残疾人','农用拖挂车','小孩','车型行驶车道','分隔带左右侧通行'
			]

i_dict = {}
i=0
for ist in i_string:
	if i+1 == 17: i+=1
	if i+1 == 74: i+=3
	i_dict['i' + str(i+1)] = ist
	i+=1

iother_dict = {'il':'最低限速'}
for instruction in instructions_l:
	symbol, number = instruction[:2], instruction[2:]
	string = iother_dict[symbol]
	i_dict.update({instruction:string+str(number)+'km/h'})

# 指示标志 symbol 转 string
a_string = ['直行','右前方','右转','靠右行驶','当前车道','靠左行驶','左转','左前方']
a_dict = {}
for i, ast in enumerate(a_string):
	a_dict['a' + str(i+1)] = ast

all_symbols = {}
all_symbols.update(p_dict)
all_symbols.update(w_dict)
all_symbols.update(i_dict)
all_symbols.update(a_dict)
print(all_symbols)
